---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.SetExportLinetypeTable(Autodesk.Revit.DB.ExportLinetypeTable)
source: html/7e4e09ba-d012-7ad9-762e-a0eb732b2178.htm
---
# Autodesk.Revit.DB.BaseExportOptions.SetExportLinetypeTable Method

Sets the line type table to use during export.

## Syntax (C#)
```csharp
public void SetExportLinetypeTable(
	ExportLinetypeTable linetypeTable
)
```

## Parameters
- **linetypeTable** (`Autodesk.Revit.DB.ExportLinetypeTable`) - The line type table to be set.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null